Show / Hide Table of Contents
Class ResultOnMesh
Inheritance
System.Object
ResultOnMesh
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
public class ResultOnMesh
Constructors
Improve this Doc   View Source
ResultOnMesh()
Declaration
public ResultOnMesh()
Properties
Improve this Doc   View Source
Displacement
Declaration
[DataMember]
public List<double[]> Displacement { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Double[]>
Improve this Doc   View Source
Nodes
Declaration
[DataMember]
public List<double[]> Nodes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Double[]>
Improve this Doc   View Source
PlatesElement
List of elements for each plate UID
Declaration
[DataMember]
public List<PlateElements> PlatesElement { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PlateElements>
Improve this Doc   View Source
Value
Declaration
[DataMember]
public List<double> Value { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Double>
 Improve this Doc
 View Source